compounds_list = ["Оксид углеродa", "Метан", "Бутан", "Пентан",
                  "Гептан", "Декан", "Бензол", "Толуол", "Ксилол", "Стирол",
                  "Этанол", "Бутанол", "Фенол", "Ацетон", "Фурфурол",
                  "Акролеин", "Этилацетат", "Уксусная кислота"]

ad_raz_list = [91, 297, 868, 1179, 1495, 2050, 1101, 1318, 1413, 1483,
               410, 907, 996, 597, 775, 428, 751, 291]

const1_list = [600, 1140000, 770000, 118000, 43800, 1450000,
               120000, 25100, 1450000, 120000, 1090000,
               160000, 120000, 160000, 1900, 1470, 205, 403000]

const2_list = [-7600, -19017, -16600, -13700, -10300,
               -15000, -11000, -11430,
               -15000, -11000, -14900, -11610, -11000,
               -11900, -7200, -5300, -4830, -13600]

const3_list = [None, None, None, None, None, None,
               None, None, None, None, None, None,
               None, None, None, 5.5, 2.35e-16, 6.06]

const4_list = [None, None, None, None, None, None,
               None, None, None, None, None, None,
               None, None, None, 5100, -10730, 4530]

compounds_dict = {'Оксид углеродa': {'ad_raz': 91, 'c1': 600, 'c2': -7600, 'c3': None, 'c4': None},
                  'Метан': {'ad_raz': 297, 'c1': 1140000, 'c2': -19017, 'c3': None, 'c4': None},
                  'Бутан': {'ad_raz': 868, 'c1': 770000, 'c2': -16600, 'c3': None, 'c4': None},
                  'Пентан': {'ad_raz': 1179, 'c1': 118000, 'c2': -13700, 'c3': None, 'c4': None},
                  'Гептан': {'ad_raz': 1495, 'c1': 43800, 'c2': -10300, 'c3': None, 'c4': None},
                  'Декан': {'ad_raz': 2050, 'c1': 1450000, 'c2': -15000, 'c3': None, 'c4': None},
                  'Бензол': {'ad_raz': 1101, 'c1': 120000, 'c2': -11000, 'c3': None, 'c4': None},
                  'Толуол': {'ad_raz': 1318, 'c1': 25100, 'c2': -11430, 'c3': None, 'c4': None},
                  'Ксилол': {'ad_raz': 1413, 'c1': 1450000, 'c2': -15000, 'c3': None, 'c4': None},
                  'Стирол': {'ad_raz': 1483, 'c1': 120000, 'c2': -11000, 'c3': None, 'c4': None},
                  'Этанол': {'ad_raz': 410, 'c1': 1090000, 'c2': -14900, 'c3': None, 'c4': None},
                  'Бутанол': {'ad_raz': 907, 'c1': 160000, 'c2': -11610, 'c3': None, 'c4': None},
                  'Фенол': {'ad_raz': 996, 'c1': 120000, 'c2': -11000, 'c3': None, 'c4': None},
                  'Ацетон': {'ad_raz': 597, 'c1': 160000, 'c2': -11900, 'c3': None, 'c4': None},
                  'Фурфурол': {'ad_raz': 775, 'c1': 1900, 'c2': -7200, 'c3': None, 'c4': None},
                  'Акролеин': {'ad_raz': 428, 'c1': 1470, 'c2': -5300, 'c3': 5.5, 'c4': 5100},
                  'Этилацетат': {'ad_raz': 751, 'c1': 205, 'c2': -4830, 'c3': 2.35e-16, 'c4': -10730},
                  'Уксусная кислота': {'ad_raz': 291, 'c1': 403000, 'c2': -13600, 'c3': 6.06, 'c4': 4530}}


















